Repository: Fahad-Alsubaihi/new_athkar
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: My Athkar
ar: أذكاري

# benifit
source: Source
ar: المصدر

source: Settings
ar: الإعدادات

# defaultSettings
source: Reset to Default
ar: استعادة الإعدادات الإفتراضية

source: Font size
ar: حجم الخط

source: Language
ar: اللغة

source: City
ar: المدينة

# resetProgress
source: Reset Athkar Progress
ar: تصفير تقدّم الأذكار

# resetDone
source: Settings restored successfully
ar: تم إعادة ضبط الإعدادات الافتراضية

source: Morning Athkar
ar: أذكار الصباح

source: Evening Athkar
ar: أذكار المساء

# vibrationOn
source: Enabled
ar: مفعّل

# vibrationOff
source: Disabled
ar: مطفّي

# vibrationMode
source: Counter Vibration
ar: اهتزاز عدّاد الأذكار

# vibrationSubtitle
source: Vibrates with each count during athkar
ar: يهتز مع كل عدّة أثناء الذكر

source: fajr
ar: الفجر

source: sunrise
ar: الشروق

source: dhuhr
ar: الظهر

source: asr
ar: العصر

source: maghrib
ar: المغرب

source: isha
ar: العشاء

source: jumuah
ar: الجمعة

source: remaining
ar: متبقي

source: since
ar: منذ

# prayerReminderNotifTitle
source: Prayer Time
ar: وقت الصلاة

# prayerReminderBody
source: It is now time for {prayer}
ar: دخل الآن وقت صلاة {prayer}

# athkarReminderNotifTitle
source: Athkar
ar: الأذكار

# athkarMorningReminderBody
source: Time for Morning Athkar
ar: حان وقت أذكار الصباح

# athkarEveningReminderBody
source: Time for Evening Athkar
ar: حان وقت أذكار المساء

source: Reminders
ar: التنبيهات

# prayerReminderTitle
source: Prayer reminders
ar: تذكير الصلاة

# prayerReminderSubtitle
source: Notify at each prayer time
ar: تنبيه عند كل صلاة

# athkarReminderTitle
source: Athkar reminders
ar: تذكير الأذكار

# athkarReminderSubtitle
source: 1 hour after Fajr and Asr
ar: بعد أذان الفجر والعصر بساعة

# remindersNote
source: You may need to allow notifications in system settings.
ar: قد تحتاج السماح بالإشعارات من إعدادات الجهاز.

source: Use my current location
ar: استخدم موقعي الحالي

# locationPermissionRequired
source: Please enable location services and grant location permission.
ar: فضلاً فعّل خدمات الموقع واسمح للتطبيق بالوصول للموقع

# notificationPermissionRequired
source: Please enable notifications to allow the app to send alerts
ar: فضلاً فعّل الإشعارات للسماح للتطبيق بإرسال التنبيهات

# locationUpdating
source: Getting your locationâ€¦
ar: جاري تحديد الموقع…

source: Location updated
ar: تم تحديث الموقع

# locationUpdateFailed
source: Couldn't get your location.
ar: تعذر تحديد الموقع.

# lastLocationUpdate
source: Last updated
ar: آخر تحديث

source: My current location
ar: موقعي الحالي

# nextPrayerAdhan
source: {prayer} Adhan in {time}
ar: متبقي على أذان {prayer} {time}

# adhanSince
source: Adhan for {prayer} was {minutes} min ago
ar: أذّن لصلاة {prayer} منذ {minutes} دقيقة

# remainingH
source: hour
ar: ساعة

# remainingM
source: minute
ar: دقيقة

# calculationMethod
source: According to the Umm al-Qura calendar
ar: حسب تقويم أم القرى

# nextPrayerIqama
source: {prayer} Iqama in {time}
ar: متبقي على إقامة {prayer} {time}

# nextEventIn
source: {event} in {time}
ar: متبقي على {event} {time}

# sinceEvent
source: {event} since {time}
ar: {event} منذ {time}
